//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

#Область ЗаполнениеОбработчиковФормы

// см. МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере 
&После("ПриСозданииНаСервере")
Процедура МФ_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	Если Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		МФ_МодификацияКонфигурации.КонтрагентыФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти