//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// см. МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере 
Процедура КонтрагентыФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	Элементы = Форма.Элементы;
	
	СтраницаОсновное = Элементы.Найти("СтраницаОсновное");
	ГруппаПеред = Элементы.Найти("ГруппаПартнерНаименование");
	
	НовыйЭлемент = Элементы.Вставить("МФ_КодКАИС", Тип("ПолеФормы"), СтраницаОсновное, ГруппаПеред);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Код КАИС";
	НовыйЭлемент.ПодсказкаВвода = "А0007";
	НовыйЭлемент.ПодсказкаВвода = "Код клиента на сайте КАИС";
	НовыйЭлемент.ПутьКДанным = "Объект.МФ_КодКАИС";

КонецПроцедуры

#КонецОбласти
