
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьЗаказы(Команда)
	
	ОчиститьСообщения();
	
	ВыбранаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ВыбранаяСтрока <> Неопределено Тогда

	ОбновитьЗаказыНаСервере(ВыбранаяСтрока.Ссылка);
			
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.ЗаказКлиента"));
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновить заказы на сервере.
// 
// Параметры:
//  Профиль - СправочникСсылка.МФ_ПрофилиKAIS - Профиль
&НаСервереБезКонтекста
Процедура ОбновитьЗаказыНаСервере(Профиль)

	МФ_Заказы.ОбновитьСписокЗаказов(Профиль);
	
КонецПроцедуры

#КонецОбласти

