//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// Обработчик команды 'Настройки поверки и ТО' для формы элемента справочника Номенклатура
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка.ЗаказКлиента - Массив объектов
//  ДополнительныеПараметры - Произвольный - Дополнительные параметры
Процедура ОбновитьЗаказыКлиентов(МассивОбъектов, ДополнительныеПараметры) Экспорт

	ОчиститьСообщения();

	Форма = ДополнительныеПараметры.Форма;

	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = МФ_ПодключаемыеКомандыВызовСервера.НачатьОбновлениеЗаказовКлиентов(Форма.УникальныйИдентификатор);
		
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);

	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru='Обновление заказов клиентов завершено'");
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
											   Новый ОписаниеОповещения("ПриЗавершенииОбновленияЗаказовКлиентов",
																		ЭтотОбъект),
											   ПараметрыОжидания);

КонецПроцедуры

// Обработчик команды 'Настройки поверки и ТО' для формы элемента справочника Номенклатура
// 
// Параметры:
//  МассивОбъектов - Массив из СправочникСсылка.ФО_НастройкиОтправкиОтчетности - Массив объектов
//  ДополнительныеПараметры - Произвольный - Дополнительные параметры
Процедура СоздатьЗаказыПоставщикам(МассивОбъектов, ДополнительныеПараметры) Экспорт

	ОчиститьСообщения();

	Форма = ДополнительныеПараметры.Форма;

//	ПараметрыОтчетности = Новый Структура("ПараметрыПодключаемыхКоманд, Профиль, Форма, Вариант",
//										  Форма.ПараметрыПодключаемыхКоманд,
//										  МассивОбъектов[0],
//										  Форма,
//										  "По балансу");
//
//	ОбщегоНазначенияУТКлиент.ПоказатьВыборДаты(ОбщегоНазначенияКлиент.ДатаСеанса(),
//											   НСтр("ru = 'Отчетность на дату'"),
//											   ЧастиДаты.Дата,
//											   Новый ОписаниеОповещения("ВыборДатыЗавершение",
//																		ЭтотОбъект,
//																		ПараметрыОтчетности));

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗавершенииОбновленияЗаказовКлиентов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда
	
		Нечто = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Пост = Нечто.НеизвестныеПоставщики;
		
		Если Пост.Количество() > 0 Тогда

		ТекстСообщения = "Есть заказы от неизвестных клиентов:";

		Для Каждого Элемент Из Пост Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + Элемент;
		КонецЦикла;

		НавигационнаяСсылка = "";
		Если Нечто.Свойство("Заметка") Тогда
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Нечто["Заметка"]);	
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(ТекстСообщения, НавигационнаяСсылка, , , СтатусОповещенияПользователя.Важное);
					
		КонецЕсли;
			
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.ЗаказКлиента"));

КонецПроцедуры

#КонецОбласти