#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Данные профиля.
// 
// Параметры:
//  Профиль - СправочникСсылка.МФ_ПрофилиKAIS - Профиль
// 
// Возвращаемое значение:
//  Структура - Данные профиля:
// * Логин - Строка - 
// * Пароль - Строка - 
// * Адрес - Строка - 
// * РежимЗаказовБезДетализации - Строка - 
// * РежимЗаказовСДетализацией - Строка - 
// * РесурсЗаказы - Строка - 
// * РесурсЗаказ - Строка - 
// * РесурсКлиент - Строка - 
// * ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры - 
// * Склад - СправочникСсылка.Склады - 
// * ДнейПросмотра - Число - 
// * Организация - СправочникСсылка.Организации - Организация
// * МинимальнаяДата - Дата - Минимальная дата анализируемого заказа сайта
Функция ДанныеПрофиля(Профиль) Экспорт

	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Логин");
	Реквизиты.Добавить("Пароль");
	Реквизиты.Добавить("Адрес");
	Реквизиты.Добавить("РежимЗаказовБезДетализации");
	Реквизиты.Добавить("РежимЗаказовСДетализацией");
	Реквизиты.Добавить("РесурсЗаказы");
	Реквизиты.Добавить("РесурсЗаказ");
	Реквизиты.Добавить("РесурсКлиент");
	Реквизиты.Добавить("ВидНоменклатуры");
	Реквизиты.Добавить("Склад");
	Реквизиты.Добавить("ДнейПросмотра");
	Реквизиты.Добавить("Организация");

	ДанныеПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, Реквизиты);

	ДанныеПрофиля.Вставить("МинимальнаяДата", ТекущаяДатаСеанса() - ДанныеПрофиля.ДнейПросмотра * 24 * 60 * 60);

	Возврат ДанныеПрофиля;

КонецФункции

#КонецОбласти

#КонецЕсли