//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает расширенные данные профиля.
// 
// Параметры:
//  Профиль - СправочникСсылка.МФ_ПрофилиKAIS - Профиль
// 
// Возвращаемое значение:
//  Структура - Данные профиля:
// * Логин - Строка - 
// * Пароль - Строка - 
// * Адрес - Строка - 
// * РежимЗаказовБезДетализации - Строка - 
// * РежимЗаказовСДетализацией - Строка - 
// * РесурсЗаказы - Строка - 
// * РесурсЗаказ - Строка - 
// * РесурсКлиент - Строка - 
// * ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры - 
// * Склад - СправочникСсылка.Склады - 
// * ДнейПросмотра - Число - 
// * Организация - СправочникСсылка.Организации - Организация
// * МинимальнаяДата - Дата - Минимальная дата анализируемого заказа сайта
// * Заголовки - см. Заголовки 
Функция ДанныеПрофиля(Профиль) Экспорт

	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Логин");
	Реквизиты.Добавить("Пароль");
	Реквизиты.Добавить("Адрес");
	Реквизиты.Добавить("РежимЗаказовБезДетализации");
	Реквизиты.Добавить("РежимЗаказовСДетализацией");
	Реквизиты.Добавить("РесурсЗаказы");
	Реквизиты.Добавить("РесурсЗаказ");
	Реквизиты.Добавить("РесурсКлиент");
	Реквизиты.Добавить("ВидНоменклатуры");
	Реквизиты.Добавить("Склад");
	Реквизиты.Добавить("ДнейПросмотра");
	Реквизиты.Добавить("Организация");

	ДанныеПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, Реквизиты);
	Заголовки = Заголовки(ДанныеПрофиля.Адрес);

	ДанныеПрофиля.Вставить("МинимальнаяДата", ТекущаяДатаСеанса() - ДанныеПрофиля.ДнейПросмотра * 24 * 60 * 60);
	ДанныеПрофиля.Вставить("Заголовки", Заголовки);
	
	//@skip-check constructor-function-return-section
	Возврат ДанныеПрофиля;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует заголовки для HTTP - соединения
// 
// Параметры:
//  Хост - Строка - Адрес
// 
// Возвращаемое значение:
//  Соответствие из Строка - Заголовки для HTTP - соединения
Функция Заголовки(Хост)

	Реферер = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("http://%1/", Хост);

	Заголовки = Новый Соответствие;

	Заголовки.Вставить("Host", Хост);
	Заголовки.Вставить("Connection", "keep-alive");
	Заголовки.Вставить("Upgrade-Insecure-Requests", "1");
	Заголовки.Вставить("User-Agent",
					   "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.110 Safari/537.36 Edg/96.0.1054.62");
	Заголовки.Вставить("Accept",
					   "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9");
	Заголовки.Вставить("Referer", Реферер);
	Заголовки.Вставить("Accept-Language", "ru,en;q=0.9,en-GB;q=0.8,en-US;q=0.7");
	Заголовки.Вставить("Cookie",
					   "PHPSESSID=pe8m04cl41iotc59f795itv9hfgfjue8; auth=69dad64f39ab8925696e61891f197f29; _ym_isad=2; company_id=79; notice_seen=1640671260; shop_brand_size=24px");
	Заголовки.Вставить("Accept-Encoding", "identity");

	Возврат Заголовки

КонецФункции

#КонецОбласти

#КонецЕсли