//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// Начать формирование JSON.
// 
// Параметры:
//  Профиль - СправочникСсылка.ФО_НастройкиОтправкиОтчетности - Профиль отправки
//  Дата - Дата - Дата
//  УникальныйИдентификатор - Строка - Уникальный идентификатор
// 
// Возвращаемое значение: см.  ДлительныеОперации.ВыполнитьФункцию
Функция НачатьОбновлениеЗаказовКлиентов(УникальныйИдентификатор) Экспорт

	ИмяФункции = "МФ_Заказы.ОбновитьСписокЗаказов";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяФункции);

КонецФункции
	
// Начать формирование JSON.
// 
// Параметры:
//  Профиль - СправочникСсылка.ФО_НастройкиОтправкиОтчетности - Профиль отправки
//  Дата - Дата - Дата
//  УникальныйИдентификатор - Строка - Уникальный идентификатор
// 
// Возвращаемое значение: см.  ДлительныеОперации.ВыполнитьПроцедуру
Функция НачатьФормированиеJSONПоБалансу(Профиль, Дата, УникальныйИдентификатор) Экспорт

	ИмяПроцедуры = "ФО_Отчетность.ОтправкаФинансовойОтчетностиПоБалансу";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ИмяПроцедуры, Профиль, Дата);

КонецФункции

#КонецОбласти