//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// Начать обновление заказов клиентов
// 
// Параметры:
//  Профиль - СправочникСсылка.ФО_НастройкиОтправкиОтчетности - Профиль отправки
//  Дата - Дата - Дата
//  УникальныйИдентификатор - Строка - Уникальный идентификатор
// 
// Возвращаемое значение: см.  ДлительныеОперации.ВыполнитьФункцию
Функция НачатьОбновлениеЗаказовКлиентов(УникальныйИдентификатор) Экспорт

	ИмяФункции = "МФ_Заказы.ЗаказыКлиентов";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяФункции);

КонецФункции
	
// Начать формирование JSON.
// 
// Параметры:
//  УникальныйИдентификатор - Строка - Уникальный идентификатор
// 
// Возвращаемое значение: см.  ДлительныеОперации.ВыполнитьФункцию
Функция НачатьОбновлениеЗаказовПоставщикам(УникальныйИдентификатор) Экспорт

	ИмяФункции = "МФ_Заказы.ЗаказыПоставщикам";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяФункции);

КонецФункции

#КонецОбласти