//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд 
&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура МФ_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт

	МФ_ПодключаемыеКоманды.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);

КонецПроцедуры

// см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура МФ_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт

	МФ_ПодключаемыеКоманды.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы,
																	Источники,
																	ПодключенныеОтчетыИОбработки,
																	Команды);
КонецПроцедуры

#КонецОбласти