//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// Создает заказы клиентов для зарегистрированных клиентов, возвращает список неизвестных клиентов
// 
// Параметры:
//  Профиль - СправочникСсылка.МФ_ПрофилиKAIS, Неопределено - Профиль
// 
// Возвращаемое значение:
//  Структура - Обновить заказы:
// * НеизвестныеКонтрагенты - Массив Из Произвольный - 
Функция ЗаказыКлиентов(Профиль = Неопределено) Экспорт

	РезультатОбновления = Новый Структура;

	НеизвестныеКонтрагенты = Новый Массив;
	
	// Получение набора профилей
	НаборПрофилей = НаборПрофилей(Профиль);

	Для Каждого ТекущийПрофиль Из НаборПрофилей Цикл

		ДанныеПрофиля = ДанныеПрофиля(ТекущийПрофиль);
		ЗаказыНаСайте = МФ_ИнтерфейсССайтом.СписокЗаказов(ДанныеПрофиля);

		Для Каждого ЗаказНаСайте Из ЗаказыНаСайте Цикл

			Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("МФ_КодКАИС", ЗаказНаСайте.КлиентКод);

			Если Контрагент.Пустая() Тогда

				ОписаниеКонтрагента = СтрШаблон("%1 -- %2", ЗаказНаСайте.КлиентКод, ЗаказНаСайте.КлиентСайта);

				ИндексВСписке = НеизвестныеКонтрагенты.Найти(ОписаниеКонтрагента);

				Если ИндексВСписке = Неопределено Тогда
					НеизвестныеКонтрагенты.Добавить(ОписаниеКонтрагента);
				КонецЕсли;

			Иначе

				ТаблицаТовары = МФ_ИнтерфейсССайтом.СодержимоеЗаказа(ЗаказНаСайте.Идентификатор, ДанныеПрофиля);

				Если ТаблицаТовары.Количество() > 0 Тогда

					НайденЗаказ = Документы.ЗаказКлиента.НайтиПоРеквизиту("НомерПоДаннымКлиента", ЗаказНаСайте.Номер);

					Если НайденЗаказ.Пустая() Тогда
						
						//@skip-check query-in-loop
						ДанныеСоглашения = ДанныеСоглашенияКонтрагента(Контрагент);

						ТекстСообщения = СтрШаблон("Создание заказа %1", ЗаказНаСайте.Номер);
						ДлительныеОперации.СообщитьПрогресс(, ТекстСообщения);

						ПартнерСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер");

						ДанныеЗаказа = ДанныеНовогоЗаказа(ДанныеПрофиля);

						ДанныеЗаказа.Вставить("МФ_Идентификатор", ЗаказНаСайте.Идентификатор);
						ДанныеЗаказа.Вставить("МФ_Номер", ЗаказНаСайте.Номер);
						ДанныеЗаказа.Вставить("Дата", ЗаказНаСайте.Дата);
						ДанныеЗаказа.Вставить("НомерПоДаннымКлиента", ЗаказНаСайте.Номер);
						ДанныеЗаказа.Вставить("ДатаПоДаннымКлиента", ЗаказНаСайте.Дата);
						ДанныеЗаказа.Вставить("Контрагент", Контрагент);
						ДанныеЗаказа.Вставить("Партнер", ПартнерСсылка);
						ДанныеЗаказа.Вставить("Комментарий", СтрШаблон("Клиент: код - %1, наименование - %2",
																	   ЗаказНаСайте.КлиентКод,
																	   ЗаказНаСайте.КлиентСайта));

						ЗаказКлиента = Документы.ЗаказКлиента.СоздатьДокумент();
						ЗаказКлиента.Заполнить(ДанныеЗаказа);

						ЗаполнитьЗначенияСвойств(ЗаказКлиента, ДанныеЗаказа,, "Организация");

						Если ДанныеСоглашения <> Неопределено Тогда
							ЗаполнитьЗначенияСвойств(ЗаказКлиента, ДанныеСоглашения);
						КонецЕсли;

						ЗаказКлиента.Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеПрофиля.Организация);

						ЗаполнитьТабличнуюЧастьТовары(ЗаказКлиента, ДанныеПрофиля, ТаблицаТовары);

						Попытка
							ЗаказКлиента.Записать(РежимЗаписиДокумента.Запись);
						Исключение
							ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
						КонецПопытки;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	РезультатОбновления.Вставить("НеизвестныеКонтрагенты", НеизвестныеКонтрагенты);

	Если НеизвестныеКонтрагенты.Количество() > 0 Тогда

		СоздатьЗаметкуОНеизвестныхПокупателях(РезультатОбновления, НеизвестныеКонтрагенты);

	КонецЕсли;

	Возврат РезультатОбновления;

КонецФункции

// Создает заказы клиентов для зарегистрированных клиентов, возвращает список неизвестных клиентов
// 
// Параметры:
//  Профиль - СправочникСсылка.МФ_ПрофилиKAIS, Неопределено - Профиль
// 
// Возвращаемое значение:
//  Структура - Обновить заказы:
// * НеизвестныеКонтрагенты - Массив Из Произвольный - 
Функция ЗаказыПоставщикам() Экспорт

	РезультатОбновления = Новый Структура;

	НеизвестныеКонтрагенты = Новый Массив;
	
	// Получение набора профилей

	Если НеизвестныеКонтрагенты.Количество() > 0 Тогда

		СоздатьЗаметкуОНеизвестныхПокупателях(РезультатОбновления, НеизвестныеКонтрагенты);

	КонецЕсли;

	Возврат РезультатОбновления;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает набор профилей для обновления заказов
// 
// Параметры:
//  Профиль - СправочникСсылка.МФ_ПрофилиKAIS, Неопределено - Профиль
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.МФ_ПрофилиKAIS - Набор профилей
Функция НаборПрофилей(Профиль)

	Если Профиль = Неопределено Тогда

		ТекстЗапроса = "ВЫБРАТЬ
					   |	МФ_ПрофилиKAIS.Ссылка КАК Ссылка
					   |ИЗ
					   |	Справочник.МФ_ПрофилиKAIS КАК МФ_ПрофилиKAIS
					   |ГДЕ
					   |	МФ_ПрофилиKAIS.ПометкаУдаления = ЛОЖЬ";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Профиль);

		Результат = Запрос.Выполнить().Выгрузить();

		Набор = Результат.ВыгрузитьКолонку("Ссылка");

	Иначе

		Набор = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Профиль);

	КонецЕсли;

	Возврат Набор;

КонецФункции

Процедура ЗаполнитьТабличнуюЧастьТовары(ЗаказКлиента, ДанныеПрофиля, СодержимоеЗаказа)

	СуммаДокумента = 0;

	Для Каждого СтрокаЗаказаНаСайте Из СодержимоеЗаказа Цикл	// 		Для Каждого Эл Из СтрокиТаблицы Цикл

		ТоварСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаЗаказаНаСайте.Артикул);

		Если ТоварСсылка.Пустая() И Не ПустаяСтрока(СтрокаЗаказаНаСайте.НоменклатураСайта) Тогда

			ТоварОбъект = НоваяНоменклатура(ДанныеПрофиля);

			ТоварОбъект.Наименование = СтрокаЗаказаНаСайте.НаименованиеНоменклатуры;
			ТоварОбъект.Артикул = СтрокаЗаказаНаСайте.Артикул;

			Производитель = НайтиСоздатьПроизводителя(СтрокаЗаказаНаСайте.НаименованиеПроизводителя);

			ТоварОбъект.Производитель = Производитель;

			Попытка

				ТоварОбъект.Записать();
				ТоварСсылка = ТоварОбъект.Ссылка;

			Исключение

				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
				ТоварСсылка = Справочники.Номенклатура.ПустаяСсылка();

			КонецПопытки;

		КонецЕсли;

		СтрокаТЧТовары = ЗаказКлиента.Товары.Добавить();

		СтрокаТЧТовары.Номенклатура = ТоварСсылка;
		СтрокаТЧТовары.Количество = СтрокаЗаказаНаСайте.Количество;
		СтрокаТЧТовары.КоличествоУпаковок = СтрокаЗаказаНаСайте.Количество;
		СтрокаТЧТовары.Цена = СтрокаЗаказаНаСайте.Цена;
		СтрокаТЧТовары.Сумма = СтрокаЗаказаНаСайте.Цена * СтрокаЗаказаНаСайте.Количество;
		СтрокаТЧТовары.СуммаСНДС = СтрокаТЧТовары.Сумма;
		СтрокаТЧТовары.СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварСсылка, "СтавкаНДС");
		СтрокаТЧТовары.СуммаНДС = СтрокаТЧТовары.Сумма / 120 * 20;
		СтрокаТЧТовары.Обособленно = Истина;
		СтрокаТЧТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
		СтрокаТЧТовары.Отменено = СтрокаЗаказаНаСайте.Отказ;

		Если Не СтрокаТЧТовары.Отменено Тогда
			СуммаДокумента = СуммаДокумента + СтрокаТЧТовары.Сумма;
		КонецЕсли;

	КонецЦикла;

	ЗаказКлиента.СуммаДокумента = СуммаДокумента;

КонецПроцедуры

Процедура СоздатьЗаметкуОНеизвестныхПокупателях(РезультатОбновления, НеизвестныеПоставщики)

	НаФормированиеЗаметки = Новый Массив;

	НаФормированиеЗаметки.Добавить("На сайте КАИС есть заказы от неизвестных поставщиков;");

	Для Каждого Элемент Из НеизвестныеПоставщики Цикл
		НаФормированиеЗаметки.Добавить(Элемент);
	КонецЦикла;

	ТекстЗаметки = Новый ФорматированнаяСтрока(СтрСоединить(НаФормированиеЗаметки, Символы.ПС));

	Заметка = Справочники.Заметки.СоздатьЭлемент();
	Заметка.Заполнить(Неопределено);
	Заметка.Автор = Пользователи.АвторизованныйПользователь();
	Заметка.ДатаИзменения = ТекущаяДатаСеанса();
	Заметка.ДляРабочегоСтола = Истина;
	Заметка.Пометка = Перечисления.ЦветаЗаметок.Голубой;
	Заметка.Содержание = Новый ХранилищеЗначения(ТекстЗаметки, Новый СжатиеДанных(9));
	Заметка.ТекстСодержания = ТекстЗаметки;

	Попытка

		Заметка.Записать();
		ЗаметкаСсылка = Заметка.Ссылка;

	Исключение

		ЗаметкаСсылка = Неопределено;

	КонецПопытки;

	РезультатОбновления.Вставить("Заметка", ЗаметкаСсылка);

КонецПроцедуры

// Возвращает данные профиля.
// 
// Параметры:
//  Профиль - СправочникСсылка.МФ_ПрофилиKAIS - Профиль
// 
// Возвращаемое значение: см. СправочникМенеджер.МФ_ПрофилиKAIS.ДанныеПрофиля 
//  
Функция ДанныеПрофиля(Профиль)

	ДанныеПрофиля = Справочники.МФ_ПрофилиKAIS.ДанныеПрофиля(Профиль);

	Возврат ДанныеПрофиля;

КонецФункции

Функция ДанныеСоглашенияКонтрагента(Контрагент)

	Результат = Неопределено;

	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	СоглашенияСКлиентами.Ссылка КАК Соглашение,
				   |	СоглашенияСКлиентами.Организация КАК Организация,
				   |	СоглашенияСКлиентами.ИспользуютсяДоговорыКонтрагентов КАК ИспользуютсяДоговорыКонтрагентов
				   |ИЗ
				   |	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
				   |ГДЕ
				   |	СоглашенияСКлиентами.Контрагент = &Контрагент
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	СоглашенияСКлиентами.ДатаНачалаДействия УБЫВ";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Результат = Выборка;

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Данные нового заказа.
// 
// Параметры:
//  ДанныеПрофиля - См. СправочникМенеджер.МФ_ПрофилиKAIS.ДанныеПрофиля
// 
// Возвращаемое значение:
//  Структура - Данные нового заказа:
// * Статус - ПеречислениеСсылка.СтатусыЗаказовКлиентов - 
// * Автор - СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи - 
// * Приоритет - СправочникСсылка.Приоритеты, Неопределено - 
// * Склад - СправочникСсылка.Склады - 
Функция ДанныеНовогоЗаказа(ДанныеПрофиля)

	ДанныеЗаказа = Новый Структура;
	ДанныеЗаказа.Вставить("Статус", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	ДанныеЗаказа.Вставить("Автор", Пользователи.АвторизованныйПользователь());
	ДанныеЗаказа.Вставить("Приоритет", ЗначениеНастроекПовтИсп.ПолучитьПриоритетПоУмолчанию());
	ДанныеЗаказа.Вставить("Склад", ДанныеПрофиля.Склад);
	ДанныеЗаказа.Вставить("ЦенаВключаетНДС", Истина);
	ДанныеЗаказа.Вставить("Организация", ДанныеПрофиля.Организация);

	Возврат ДанныеЗаказа

КонецФункции

// Возвращает ссылку найденного по наименованию либо созданного производителя
// 
// Параметры:
//  Наименование - Строка - Наименование
// 
// Возвращаемое значение:
//  СправочникСсылка.Производители - Производитель с наименованием Наименование
Функция НайтиСоздатьПроизводителя(Наименование)

	ПроизводительСсылка = Справочники.Производители.НайтиПоНаименованию(Наименование);

	Если ПроизводительСсылка.Пустая() Тогда

		ПроизводительОбъект = Справочники.Производители.СоздатьЭлемент();
		ПроизводительОбъект.Заполнить(Неопределено);

		ПроизводительОбъект.Наименование = Наименование;

		Попытка
			ПроизводительОбъект.Записать();
			ПроизводительСсылка = ПроизводительОбъект.Ссылка;
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Ошибка создания производителя (каталога) с нименованием:'")
												  + Наименование);
		КонецПопытки;

	КонецЕсли;

	Возврат ПроизводительСсылка

КонецФункции

Функция НоваяНоменклатура(ДанныеПрофиля)

	ТоварОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	ТоварОбъект.Заполнить(Неопределено);

	ТоварОбъект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	ТоварОбъект.ВидНоменклатуры = ДанныеПрофиля.ВидНоменклатуры;

	Попытка
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(ТоварОбъект);
	Исключение
// TODO:
	КонецПопытки;
	
//	ТоварОбъект.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду();
	Возврат ТоварОбъект

КонецФункции

#КонецОбласти